[
  {
    "title": "Husband in court charged with drugging and raping ex-wife",
    "level": "h1",
    "content": [
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/2b0c/live/0a287740-dfee-11f0-a453-1d0df4c10996.png.webp",
        "alt": "Pracedo Philip Young is standing in an office wearing a blue shirt and smiling."
      },
      {
        "type": "text",
        "value": "A former councillor has appeared in court accused of a string of sexual offences against his ex-wife over a 13-year period."
      },
      {
        "type": "text",
        "value": "Philip Young is charged with 56 offences, including multiple counts of rape and administering a substance with intent to stupefy his former spouse Joanne Young, who has waived her legal right to anonymity."
      },
      {
        "type": "text",
        "value": "Appearing at Swindon Magistrates' Court earlier, the 49-year-old - formerly of Swindon but now of Amberley Road in Enfield - confirmed his name and address. He did not enter a plea."
      },
      {
        "type": "text",
        "value": "Five other men charged with sexual offences against Ms Young, 48, appeared at the same court, with two pleading not guilty to all charges."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/1a1e/live/2d443900-dff6-11f0-bc4a-ef4a2869974a.jpg.webp",
        "alt": "PA Media A court sketch of Philip Young appearing at Swindon Magistrates' Court. He is wearing a dark zipped-up top and next to him is a bearded prison officer wearing a dark jumper, a white shirt and black tie."
      },
      {
        "type": "text",
        "value": "Among the 56 charges, Mr Young - who police described as a white British national - is accused of voyeurism, possession of indecent images of children and possession of extreme images."
      },
      {
        "type": "text",
        "value": "Dressed in a pair of dark blue jeans and a black zip-up jumper, he was remanded into custody earlier."
      },
      {
        "type": "text",
        "value": "Mr Young served as a Conservative Swindon borough councillor for Covingham and Nythe between 2007 and 2010. The alleged offences are said to have taken place between 2010 and 2023."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/d0fd/live/6b02e3b0-e012-11f0-aae2-2191c0e48a3b.jpg.webp",
        "alt": "PA Media Norman Macksoni (left) and Dean Hamilton (right) seen as they arrive at Swindon Magistrates' Court. Mr Macksoni is hiding his face behind a hat. Mr Hamilton is wearing a white jumper."
      },
      {
        "type": "text",
        "value": "The following men also appeared at Swindon Magistrates' Court earlier accused of offences against Ms Young:"
      },
      {
        "type": "text",
        "value": "They were released on bail on the condition they had no contact - direct or indirect - with Ms Young. They were also told to inform Wiltshire Police of any change of address."
      },
      {
        "type": "text",
        "value": "All six men are due to appear at Swindon Crown Court for a hearing on 23 January."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/b849/live/f887d840-e016-11f0-b67b-690eb873de1b.jpg.webp",
        "alt": "PA Media/BBC A montage of the three defendants leaving Swindon Magistrates' Court. Doyle is on the left wearing a long dark coat with a furry hood. He is also wearing a black scarf covering the lower half of his face. Wilkins is wearing blue jeans, black shoes, a dark blue coat, a blue Covid-style mask and a brown woolly hat. Hassan is wearing a dark grey flat cap, a black coat and also a light blue Covid-style mask"
      },
      {
        "type": "text",
        "value": "Wiltshire Police told the BBC officers are still trying to identify another man in connection with the investigation."
      },
      {
        "type": "text",
        "value": "Based on images taken between April and May 2022, he was described as being of a large build, with scarring to the back of his head, prominent lips, a hairy body and a distinctive tattoo on the left side of his chest. He was also said to be balding with short or shaved hair."
      },
      {
        "type": "text",
        "value": "Officers have asked anyone with information about the man to contact police."
      }
    ]
  },
  {
    "title": "Husband and five other men charged with sex offences against ex-wife",
    "level": "h2",
    "content": [
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/9f30/live/b33d1bd0-ce99-11f0-8aea-9bb38a12301a.jpg.webp",
        "alt": "Red and white Tube roundel on empty platform at Stockwell station"
      }
    ]
  },
  {
    "title": "Calls grow for ban on Tube gambling ads",
    "level": "h2",
    "content": [
      {
        "type": "text",
        "value": "London councils join forces urging for a ban of betting promotions across Underground network."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/fa3a/live/8c444670-c60b-11f0-bac6-252b1f2b7e52.jpg.webp",
        "alt": "Mohammad Islam wears mayoral robes and chains in formal photo"
      }
    ]
  },
  {
    "title": "Ex mayor apologises for helping family with visas",
    "level": "h2",
    "content": [
      {
        "type": "text",
        "value": "Mohammed Islam was ordered to apologise after he was found to have helped family with their visas."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/6954/live/8510f1b0-c632-11f0-9fb5-5f3a3703a365.jpg.webp",
        "alt": "A rectangular library building with one side painted a mixture of bright colours and covered in different shapes. A bike rack with a attached bicycle is located to the right and the library is surrounded by green hedges."
      }
    ]
  },
  {
    "title": "Town library mural to stay despite objections",
    "level": "h2",
    "content": [
      {
        "type": "text",
        "value": "The council put up the mural without planning consent in a conservation area, the meeting heard."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/3084/live/c3531bf0-a84c-11f0-92db-77261a15b9d2.jpg.webp",
        "alt": "mugshots of the three defendants"
      }
    ]
  },
  {
    "title": "Trio jailed over drug dealer shooting in daylight",
    "level": "h2",
    "content": [
      {
        "type": "text",
        "value": "Two men and a woman are jailed over a plot to kill a rival drug dealers by shooting him."
      },
      {
        "type": "image",
        "url": "https://ichef.bbci.co.uk/news/480/cpsprodpb/9ca1/live/c657d030-a67a-11f0-ba4e-07314604aac8.jpg.webp",
        "alt": "A general view of High Road, in Arnos Grove. "
      }
    ]
  },
  {
    "title": "Boy critical after being shot in north London",
    "level": "h2",
    "content": [
      {
        "type": "text",
        "value": "A 17-year-old boy is critical after being shot on High Road in Arnos Grove on Thursday evening."
      }
    ]
  },
  {
    "title": "The BBC is in multiple languages",
    "level": "h3",
    "content": [
      {
        "type": "text",
        "value": "Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
      }
    ]
  }
]